{
  "additional_special_tokens": [
    "<|im_start|>user",
    "<|im_start|>assistant",
    "<|im_start|>system",
    "<|im_start|>function-call",
    "<|im_start|>function-response",
    "<|im_end|>",
    "<s>",
    "<pad>"
  ],
  "bos_token": {
    "content": "<s>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "eos_token": "<|im_end|>",
  "pad_token": "<pad>",
  "unk_token": {
    "content": "<unk>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
